tests/performance/production-load.yml
config:
  target: 'http://localhost:8081'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Normal load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
    - duration: 30
      arrivalRate: 200
      name: "Stress test"

scenarios:
  - name: "Visitor Registration Flow"
    weight: 40
    flow:
      - get:
          url: "/"
      - think: 2
      - get:
          url: "/visitor-portal"
      - think: 3
      - post:
          url: "/api/visitors/register"
          json:
            name: "Test Visitor {{ $randomString() }}"
            email: "test{{ $randomInt(1000, 9999) }}@example.com"
            purpose: "Business meeting"

  - name: "Security Guard Dashboard"
    weight: 30
    flow:
      - get:
          url: "/auth"
      - think: 1
      - post:
          url: "/api/auth/login"
          json:
            email: "guard@secure-gate.com"
            password: "test-password"
      - get:
          url: "/security-monitoring"
      - think: 5
      - get:
          url: "/api/visitors/active"

  - name: "Analytics Dashboard"
    weight: 20
    flow:
      - get:
          url: "/analytics"
      - think: 2
      - get:
          url: "/api/analytics/dashboard"
      - get:
          url: "/api/analytics/reports"
      - think: 3

  - name: "Admin Panel"
    weight: 10
    flow:
      - get:
          url: "/admin"
      - think: 1
      - get:
          url: "/api/admin/users"
      - get:
          url: "/api/admin/settings"
      - think: 2

plugins:
  expect: {}
  metrics-by-endpoint: {}

before:
  flow:
    - log: "Starting production load test..."

after:
  flow:
    - log: "Production load test completed"